Terraform Plan Output:
```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bastions.data.template_file.db_admin[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "db_admin" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            set -e
            
            echo "=== DB Admin Bastion Setup (Idempotent) ==="
            
            # Helper: Run command only if package not installed
            install_if_missing() {
              local pkg="$1"
              if dpkg -l | grep -q "^ii  $pkg "; then
                echo "Package '$pkg' already installed."
              else
                echo "Installing $pkg..."
                apt install -y "$pkg"
              fi
            }
            
            # 1. Update package list (safe to run multiple times)
            apt update -y
            
            # 2. Install basics (idempotent)
            for pkg in curl wget gnupg lsb-release jq ca-certificates awscli; do
              install_if_missing "$pkg"
            done
            
            # 3. Add PostgreSQL repo — safe to re-run
            mkdir -p /etc/apt/keyrings
            if [ ! -f /etc/apt/keyrings/postgresql.gpg ]; then
              echo "Adding PostgreSQL apt repository..."
              curl -fsSL https://www.postgresql.org/media/keys/ACCC4CF8.asc | gpg --dearmor -o /etc/apt/keyrings/postgresql.gpg
              echo "deb [signed-by=/etc/apt/keyrings/postgresql.gpg] http://apt.postgresql.org/pub/repos/apt $(lsb_release -cs)-pgdg main" > /etc/apt/sources.list.d/pgdg.list
            else
              echo "PostgreSQL repo already configured."
            fi
            
            # 4. Update again after repo add
            apt update -y
            
            # 5. Install PostgreSQL client & contrib — idempotent
            install_if_missing postgresql
            install_if_missing postgresql-contrib
            
            # 6. Verify installations
            echo "psql version:" $(psql --version 2>/dev/null || echo "not found")
            echo "curl:" $(curl --version | head -1)
            echo "aws:" $(aws --version)
            
            # 7. Auto-configure DB credentials (idempotent)
            BASHRC_LINE="# === AUTO DB CONFIG ==="
            if ! grep -q "$BASHRC_LINE" /home/ubuntu/.bashrc 2>/dev/null; then
              if [ ! -z "$RDS_ENDPOINT" ] && [ ! -z "$SECRET_ARN" ]; then
                echo "Configuring DB credentials in ~/.bashrc..."
                PASSWORD=$(aws secretsmanager get-secret-value --secret-id "$SECRET_ARN" --query SecretString --output text | jq -r .password)
            
                cat >> /home/ubuntu/.bashrc << EOF
            
            $BASHRC_LINE
            export RDS_ENDPOINT="$RDS_ENDPOINT"
            export DB_USER="administrator"
            export DB_PASSWORD="$PASSWORD"
            alias psql-db='psql "host=\$RDS_ENDPOINT user=\$DB_USER dbname=postgres password=\$DB_PASSWORD"'
            EOF
                echo "DB credentials loaded. Use: psql-db"
              fi
            else
              echo "DB config already in ~/.bashrc"
            fi
            
            echo "DB Admin Bastion READY! (Safe to re-run)"
        EOT
      + vars     = {
          + "RDS_ENDPOINT" = (known after apply)
          + "SECRET_ARN"   = (sensitive value)
        }
    }

  # module.bastions.aws_iam_instance_profile.bastion will be created
  + resource "aws_iam_instance_profile" "bastion" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "prod-bastion-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "prod-bastion-role"
      + tags_all    = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Terraform"   = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.bastions.aws_iam_role.bastion will be created
  + resource "aws_iam_role" "bastion" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-bastion-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.bastions.aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "prod-bastion-role"
    }

  # module.bastions.aws_instance.bastion["ci-runner"] will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-01fd6fa49060e89a6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "prod-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod-bastion-ci-runner-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-north-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "prod-bastion-ci-runner"
          + "Purpose" = "GitHub Actions Runner"
          + "Role"    = "ci-runner"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Name"        = "prod-bastion-ci-runner"
          + "Purpose"     = "GitHub Actions Runner"
          + "Role"        = "ci-runner"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKc2V0IC1lCgojIEluc3RhbGwgZGVwZW5kZW5jaWVzCmFwdC1nZXQgdXBkYXRlIC15CmFwdC1nZXQgaW5zdGFsbCAteSBjdXJsIGpxCgojIENyZWF0ZSBydW5uZXIgZGlyZWN0b3J5Cm1rZGlyIC1wIC9hY3Rpb25zLXJ1bm5lciAmJiBjZCAvYWN0aW9ucy1ydW5uZXIKCiMgRG93bmxvYWQgbGF0ZXN0IHJ1bm5lcgpjdXJsIC1vIGFjdGlvbnMtcnVubmVyLWxpbnV4LXg2NC50YXIuZ3ogLUwgaHR0cHM6Ly9naXRodWIuY29tL2FjdGlvbnMvcnVubmVyL3JlbGVhc2VzL2Rvd25sb2FkL3YyLjMxNy4wL2FjdGlvbnMtcnVubmVyLWxpbnV4LXg2NC0yLjMxNy4wLnRhci5negp0YXIgeHpmIC4vYWN0aW9ucy1ydW5uZXItbGludXgteDY0LnRhci5negoKIyBDb25maWd1cmUgcnVubmVyCi4vY29uZmlnLnNoIFwKICAtLXVybCBodHRwczovL2dpdGh1Yi5jb20vT3JhaW9uIFwKICAtLXRva2VuIGF3aWl3ZWlvZXJpdHJlZXdlaW9pcmVyb2l0ZWVydyBcCiAgLS1uYW1lIHByb2QtYmFzdGlvbi1jaS1ydW5uZXIgXAogIC0tdW5hdHRlbmRlZCBcCiAgLS1yZXBsYWNlIFwKICAtLWxhYmVscyB1YnVudHUsYXdzLGNpCgojIEluc3RhbGwgYW5kIHN0YXJ0IGFzIHNlcnZpY2UKc3VkbyAuL3N2Yy5zaCBpbnN0YWxsCnN1ZG8gLi9zdmMuc2ggc3RhcnQ="
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.bastions.aws_instance.bastion["db-admin"] will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-01fd6fa49060e89a6"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "prod-bastion-profile"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "prod-bastion-db-admin-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-north-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"    = "prod-bastion-db-admin"
          + "Purpose" = "RDS Admin Access"
          + "Role"    = "db-admin"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Name"        = "prod-bastion-db-admin"
          + "Purpose"     = "RDS Admin Access"
          + "Role"        = "db-admin"
          + "Terraform"   = "true"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.bastions.aws_key_pair.bastion["ci-runner"] will be created
  + resource "aws_key_pair" "bastion" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "prod-bastion-ci-runner-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + region          = "eu-north-1"
      + tags            = {
          + "Name" = "prod-bastion-ci-runner-key"
        }
      + tags_all        = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Name"        = "prod-bastion-ci-runner-key"
          + "Terraform"   = "true"
        }
    }

  # module.bastions.aws_key_pair.bastion["db-admin"] will be created
  + resource "aws_key_pair" "bastion" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "prod-bastion-db-admin-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + region          = "eu-north-1"
      + tags            = {
          + "Name" = "prod-bastion-db-admin-key"
        }
      + tags_all        = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Name"        = "prod-bastion-db-admin-key"
          + "Terraform"   = "true"
        }
    }

  # module.bastions.aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH from anywhere"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "prod-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-bastion-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Name"        = "prod-bastion-sg"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.bastions.aws_ssm_parameter.bastion_private_key["ci-runner"] will be created
  + resource "aws_ssm_parameter" "bastion_private_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Private key for ci-runner bastion"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/bastion/prod/ci-runner/private-key"
      + region         = "eu-north-1"
      + tags           = {
          + "Bastion" = "ci-runner"
        }
      + tags_all       = {
          + "Bastion"     = "ci-runner"
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.bastions.aws_ssm_parameter.bastion_private_key["db-admin"] will be created
  + resource "aws_ssm_parameter" "bastion_private_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Private key for db-admin bastion"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/bastion/prod/db-admin/private-key"
      + region         = "eu-north-1"
      + tags           = {
          + "Bastion" = "db-admin"
        }
      + tags_all       = {
          + "Bastion"     = "db-admin"
          + "Environment" = "prod"
          + "Module"      = "bastion"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.bastions.tls_private_key.bastion["ci-runner"] will be created
  + resource "tls_private_key" "bastion" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.bastions.tls_private_key.bastion["db-admin"] will be created
  + resource "tls_private_key" "bastion" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.rds_database.data.aws_iam_policy_document.rotate_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "rotate_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
              + "secretsmanager:PutSecretValue",
              + "secretsmanager:UpdateSecretVersionStage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "rds:ModifyDBInstance",
            ]
          + resources = [
              + "arn:aws:rds:eu-north-1:211125769176:db:prod-oraion-database-primary",
              + "arn:aws:rds:eu-north-1:211125769176:db:prod-oraion-database-primary-replica",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.rds_database.aws_db_instance.primary will be created
  + resource "aws_db_instance" "primary" {
      + address                               = (known after apply)
      + allocated_storage                     = 200
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_target                         = (known after apply)
      + backup_window                         = "02:00-03:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "prod-oraion-database"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "17.2"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-oraion-database-primary"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.m5.large"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:03:00-sun:04:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 1000
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "prod-oraion-database-pg"
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "eu-north-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "prod-oraion-database-primary"
          + "Role" = "primary"
        }
      + tags_all                              = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-primary"
          + "Project"     = "Oraion Data Services"
          + "Role"        = "primary"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + username                              = "administrator"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds_database.aws_db_instance.replica[0] will be created
  + resource "aws_db_instance" "replica" {
      + address                               = (known after apply)
      + allocated_storage                     = (known after apply)
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 0
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = (known after apply)
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "prod-oraion-database-replica"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.m5.large"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + region                                = "eu-north-1"
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + replicate_source_db                   = "prod-oraion-database-primary"
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "prod-oraion-database-replica"
          + "Role" = "replica"
        }
      + tags_all                              = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-replica"
          + "Project"     = "Oraion Data Services"
          + "Role"        = "replica"
          + "Terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + username                              = (known after apply)
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds_database.aws_db_parameter_group.this will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "Auto-generated PG for prod-oraion-database"
      + family       = "postgres17"
      + id           = (known after apply)
      + name         = "prod-oraion-database-pg"
      + name_prefix  = (known after apply)
      + region       = "eu-north-1"
      + skip_destroy = false
      + tags         = {
          + "Name" = "prod-oraion-database-pg"
        }
      + tags_all     = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-pg"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_disconnections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "1000"
        }
    }

  # module.rds_database.aws_db_snapshot.manual[0] will be created
  + resource "aws_db_snapshot" "manual" {
      + allocated_storage             = (known after apply)
      + availability_zone             = (known after apply)
      + db_instance_identifier        = "prod-oraion-database-primary"
      + db_snapshot_arn               = (known after apply)
      + db_snapshot_identifier        = "prod-oraion-database-manual-snapshot"
      + encrypted                     = (known after apply)
      + engine                        = (known after apply)
      + engine_version                = (known after apply)
      + id                            = (known after apply)
      + iops                          = (known after apply)
      + kms_key_id                    = (known after apply)
      + license_model                 = (known after apply)
      + option_group_name             = (known after apply)
      + port                          = (known after apply)
      + region                        = "eu-north-1"
      + snapshot_type                 = (known after apply)
      + source_db_snapshot_identifier = (known after apply)
      + source_region                 = (known after apply)
      + status                        = (known after apply)
      + storage_type                  = (known after apply)
      + tags                          = {
          + "Name" = "prod-oraion-database-manual-snapshot"
        }
      + tags_all                      = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-manual-snapshot"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + vpc_id                        = (known after apply)
    }

  # module.rds_database.aws_db_snapshot_copy.dr[0] will be created
  + resource "aws_db_snapshot_copy" "dr" {
      + allocated_storage             = (known after apply)
      + availability_zone             = (known after apply)
      + db_snapshot_arn               = (known after apply)
      + destination_region            = "eu-east-1"
      + encrypted                     = (known after apply)
      + engine                        = (known after apply)
      + engine_version                = (known after apply)
      + id                            = (known after apply)
      + iops                          = (known after apply)
      + license_model                 = (known after apply)
      + option_group_name             = (known after apply)
      + port                          = (known after apply)
      + region                        = "eu-north-1"
      + snapshot_type                 = (known after apply)
      + source_db_snapshot_identifier = (known after apply)
      + source_region                 = (known after apply)
      + storage_type                  = (known after apply)
      + tags                          = {
          + "Name" = "prod-oraion-database-dr-snapshot"
        }
      + tags_all                      = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-dr-snapshot"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + target_db_snapshot_identifier = "prod-oraion-database-dr-snapshot"
      + vpc_id                        = (known after apply)
    }

  # module.rds_database.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "prod-oraion-database"
      + name_prefix             = (known after apply)
      + region                  = "eu-north-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "prod-oraion-database-subnet-group"
        }
      + tags_all                = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-subnet-group"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds_database.aws_iam_policy.rotate_lambda[0] will be created
  + resource "aws_iam_policy" "rotate_lambda" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "prod-oraion-database-rotate-pwd-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
    }

  # module.rds_database.aws_iam_role.rds_enhanced_monitoring will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-oraion-database-rds-monitoring-roles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.rds_database.aws_iam_role.rotate_lambda[0] will be created
  + resource "aws_iam_role" "rotate_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-oraion-database-rotate-pwd-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.rds_database.aws_iam_role_policy_attachment.rds_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "prod-oraion-database-rds-monitoring-roles"
    }

  # module.rds_database.aws_iam_role_policy_attachment.rotate_lambda[0] will be created
  + resource "aws_iam_role_policy_attachment" "rotate_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-oraion-database-rotate-pwd-lambda"
    }

  # module.rds_database.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "KMS key for RDS prod-oraion-database"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "eu-north-1"
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
    }

  # module.rds_database.aws_lambda_function.rotate_rds_password[0] will be created
  + resource "aws_lambda_function" "rotate_rds_password" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../rds/rotate_lambda.zip"
      + function_name                  = "prod-oraion-database-rotate-rds-pwd"
      + handler                        = "rotate_lambda.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-north-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "JGAD9fLY+zbFgen/7fX/IlkhHNUpM0OW5cAv688BGYw="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }
    }

  # module.rds_database.aws_lambda_permission.allow_sm[0] will be created
  + resource "aws_lambda_permission" "allow_sm" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "prod-oraion-database-rotate-rds-pwd"
      + id                  = (known after apply)
      + principal           = "secretsmanager.amazonaws.com"
      + region              = "eu-north-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowSecretsManagerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.rds_database.aws_secretsmanager_secret.rds_connection will be created
  + resource "aws_secretsmanager_secret" "rds_connection" {
      + arn                            = (known after apply)
      + description                    = "Connection details for RDS instance prod-oraion-database-primary."
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "prod-oraion-database-rds-connection"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + region                         = "eu-north-1"
      + tags_all                       = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
    }

  # module.rds_database.aws_secretsmanager_secret.rds_password will be created
  + resource "aws_secretsmanager_secret" "rds_password" {
      + arn                            = (known after apply)
      + description                    = "Master password for RDS instance prod-oraion-database-primary. Auto-rotated every 30 days."
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "prod-oraion-database-rds-password"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + region                         = "eu-north-1"
      + tags                           = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-rds-password"
          + "Purpose"     = "RDS Master User Password"
        }
      + tags_all                       = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-rds-password"
          + "Project"     = "Oraion Data Services"
          + "Purpose"     = "RDS Master User Password"
          + "Terraform"   = "true"
        }
    }

  # module.rds_database.aws_secretsmanager_secret_rotation.rds_password[0] will be created
  + resource "aws_secretsmanager_secret_rotation" "rds_password" {
      + id                  = (known after apply)
      + region              = "eu-north-1"
      + rotate_immediately  = true
      + rotation_enabled    = (known after apply)
      + rotation_lambda_arn = (known after apply)
      + secret_id           = (known after apply)

      + rotation_rules {
          + automatically_after_days = 30
        }
    }

  # module.rds_database.aws_secretsmanager_secret_version.connection will be created
  + resource "aws_secretsmanager_secret_version" "connection" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-north-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.rds_database.aws_secretsmanager_secret_version.current[0] will be created
  + resource "aws_secretsmanager_secret_version" "current" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "eu-north-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.rds_database.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "App to RDS"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "prod-oraion-database-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-north-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "prod-oraion-database-rds-sg"
        }
      + tags_all               = {
          + "Component"   = "rds"
          + "DBName"      = "oraion-database"
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-database-rds-sg"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.rds_database.aws_security_group_rule.from_bastion[0] will be created
  + resource "aws_security_group_rule" "from_bastion" {
      + description              = "Bastion to RDS"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-north-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.rds_database.random_password.rds_master[0] will be created
  + resource "random_password" "rds_master" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.vpc_data_engineering.aws_cloudwatch_log_group.flow_logs[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vpc/flow-logs/prod-oraion-vpc"
      + name_prefix       = (known after apply)
      + region            = "eu-north-1"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
    }

  # module.vpc_data_engineering.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + max_aggregation_interval = 600
      + region                   = "eu-north-1"
      + tags_all                 = {
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.vpc_data_engineering.aws_iam_role.flow_logs[0] will be created
  + resource "aws_iam_role" "flow_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-oraion-vpc-vpc-flow-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + unique_id             = (known after apply)
    }

  # module.vpc_data_engineering.aws_iam_role_policy.flow_logs[0] will be created
  + resource "aws_iam_role_policy" "flow_logs" {
      + id          = (known after apply)
      + name        = "flow-logs-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.vpc_data_engineering.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-north-1"
      + tags     = {
          + "Name" = "prod-oraion-vpc-igw"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc-igw"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc_data_engineering.aws_route.public_internet[0] will be created
  + resource "aws_route" "public_internet" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "eu-north-1"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-north-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "prod-oraion-vpc-private-rt-1a"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc-private-rt-1a"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-north-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "prod-oraion-vpc-private-rt-1b"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc-private-rt-1b"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-north-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "prod-oraion-vpc-private-rt-1c"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc-private-rt-1c"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-north-1"
      + route            = (known after apply)
      + tags             = {
          + "Name" = "prod-oraion-vpc-public-rt"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc-public-rt"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "eu-north-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                            = "prod-oraion-vpc-private-1a"
          + "Tier"                            = "Private"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "prod"
          + "Name"                            = "prod-oraion-vpc-private-1a"
          + "Project"                         = "Oraion Data Services"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "VPC"                             = "oraion-vpc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                            = "prod-oraion-vpc-private-1b"
          + "Tier"                            = "Private"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "prod"
          + "Name"                            = "prod-oraion-vpc-private-1b"
          + "Project"                         = "Oraion Data Services"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "VPC"                             = "oraion-vpc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                            = "prod-oraion-vpc-private-1c"
          + "Tier"                            = "Private"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"                     = "prod"
          + "Name"                            = "prod-oraion-vpc-private-1c"
          + "Project"                         = "Oraion Data Services"
          + "Terraform"                       = "true"
          + "Tier"                            = "Private"
          + "VPC"                             = "oraion-vpc"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                   = "prod-oraion-vpc-public-1a"
          + "Tier"                   = "Public"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "Name"                   = "prod-oraion-vpc-public-1a"
          + "Project"                = "Oraion Data Services"
          + "Terraform"              = "true"
          + "Tier"                   = "Public"
          + "VPC"                    = "oraion-vpc"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                   = "prod-oraion-vpc-public-1b"
          + "Tier"                   = "Public"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "Name"                   = "prod-oraion-vpc-public-1b"
          + "Project"                = "Oraion Data Services"
          + "Terraform"              = "true"
          + "Tier"                   = "Public"
          + "VPC"                    = "oraion-vpc"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-north-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-north-1"
      + tags                                           = {
          + "Name"                   = "prod-oraion-vpc-public-1c"
          + "Tier"                   = "Public"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Environment"            = "prod"
          + "Name"                   = "prod-oraion-vpc-public-1c"
          + "Project"                = "Oraion Data Services"
          + "Terraform"              = "true"
          + "Tier"                   = "Public"
          + "VPC"                    = "oraion-vpc"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc_data_engineering.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.10.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "eu-north-1"
      + tags                                 = {
          + "Name" = "prod-oraion-vpc"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Name"        = "prod-oraion-vpc"
          + "Project"     = "Oraion Data Services"
          + "Terraform"   = "true"
          + "VPC"         = "oraion-vpc"
        }
    }

Plan: 57 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + BASTION_IP_ADDRESSES = {
      + ci-runner = (known after apply)
      + db-admin  = (known after apply)
    }
  + GET_PEM_KEYS         = <<-EOT
        To get private key for a bastion:
        
        # For db-admin
        aws ssm get-parameter --name "/bastion/prod/db-admin/private-key" --with-decryption --query "Parameter.Value" --output text > db-admin-bastion-key.pem
        chmod 400 db-admin-bastion-key.pem
        
        # For ci-runner
        aws ssm get-parameter --name "/bastion/prod/ci-runner/private-key" --with-decryption --query "Parameter.Value" --output text > ci-runner-bastion-key.pem
        chmod 400 ci-runner-bastion-key.pem
    EOT
  + RDS_PRIMARY_ENDPOINT = (known after apply)
  + RDS_REPLICA_ENDPOINT = (known after apply)
  + SECRET_ARN           = (known after apply)
  + SECRET_NAME          = "prod-oraion-database-rds-password"

```